urbanFlow/wStock/rans/winter/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p { solver GAMG; tolerance 1e-6; relTol 0.05; smoother GaussSeidel; }
    pFinal { $p; relTol 0; }
    turb { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-7; relTol 0.1; }
    "(U|k|epsilon)" { $turb; }
    "(U|k|epsilon)Final" { $turb; relTol 0; }
}
SIMPLE { residualControl { p 1e-5; U 1e-6; k 1e-6; epsilon 1e-6; } nNonOrthogonalCorrectors 2; pRefCell 0; pRefValue 0; }
relaxationFactors
{
    fields { p 0.3; }
    equations { U 0.7; "(U|k|epsilon).*" 0.7; }
}